app/controllers/products_controller.rb

INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ('3123123123', '2025-02-17 13:24:47.962240', '2025-02-17 13:24:47.962240') RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    if @product.save

UPDATE "products" SET "updated_at" = '2025-02-17 13:45:43.153697' WHERE "products"."id" = 2
---
  def update
    if @product.update(product_params)